{"2021": {"1": {"1": {"answer": "no", "notes": "Did not start veganuary on the 1st, decision was made to start late on the 2nd.\nI ate duck today, so that certainly puts me on the naught list for today.\nIt was really good duck though. Gotta love eating duck.", "images": [], "image_alts": []}, "2": {"answer": "no", "notes": "Started veganuary today, bought some vegan food.\nMight have accidentally bought some pasta sauce that's not vegan. Does not claim to be vegan, but also doesn't list any non-vegan ingredients.\nAte some things from christmas stock of treats: milk chocolate cookies, lindor milk chocolate.\nWill eventually wear down this stash, but for now the cookies and chocolate are making otherwise vegan days into not-vegan days.\nSaturday, fast food normally a thing, decided to try McDonalds' spicy veggie wrap (which is vegan). It's not bad really, quite enjoyed it, but doesn't taste as good as chicken.\nMight try the veggie dippers without the wrap next time, see what I think.\nMade a slow-cooked sausage caserole with Richmond meat-free sausages and vegan mash. It was delicious.\nTried Alpro almond milk. It tastes fine until you swallow it. Then it tastes awful.", "images": ["spicy_veggie_wrap.jpg", "sausage_casserole.jpg"], "image_alts": ["A McDonalds meal on the lap of a person (Dan) sitting in the driver's seat of their car. On the left is a packet of fries, on the right is a spicy vegie wrap.", "A sausage caserole with mashed potato made with vegan sausage substitute, on a plate ready to eat, with a knife and spoon resting on the plate."]}, "3": {"answer": "no", "notes": "Day two in the big brother house.\nNo wait, not that.\nNothing much special today, still trying to learn to like Alpro almond milk.\nI bought both the unsweetened and sugary versions for science.\nThe sugary one doesn't have that much sugar in, but tastes much better than the sugarless one.\nFeels quite a bit like normal milk, certainly cool and refreshing, but that aftertaste is nasty.\nAte more vegan mash with the left-over sausage caserole from yesterday.\nThe mash was made with the sweet almond milk this time and tasted better than yesterday's mash.\nAnother almost-vegan day except for cookies and chocolate. Will finish with those soon.", "images": ["salad.jpg"], "image_alts": ["A salad made with sliced lettuce, cherry tomatos, and sliced cucumber in a plastic food container on a bench. A bottle of balsamic vinegar salad dressing is standing next to the salad box."]}, "4": {"answer": "no", "notes": "Never bothered much to make my own salads at home. Decided this would be the time to try though.\nHad a vegan salad for breakfast. Or was it lunch? ... who knows?\nI ate the last of the cookies. So again failed to be vegan today, but at least the cookies are now gone.\nThere's still lots of chocolate in the house. I don't feel so bad eating it because it's already been purchased.\nIt's not like I'm deliberately buying non-vegan things at the moment.\nYes, I ate some chocolates, shame on me. They were lindor, they were delicious, I could eat them all day.\nMaybe that's the solution? Spend a day eating the whole chocolate stash, get to do some fully vegan days sooner.\nI tried \"This is not chicken\" today. Oh my! The flavour does not exist inside the \"chicken\" area at all. It is entirely concentrated on the outer skin, which has a breadcrumb appearance, but also looks a little ... strange. Can't explain it, but I preapred it exactly how they said to, and it tasted disgusting. I really wasn't expecting it to be that bad. I've had fake chicken nuggets before and couldn't tell them apart from real ones. These ones though ... what did they do to them? How did they make them that bad? I don't know, but I'm certainly not buying \"This\" again.", "images": ["evil.jpg"], "image_alts": ["A plate of \"This is not Chicken\" breaded chicken nugget substitutes, with a small amount of barbecue sauce on the side."]}, "5": {"answer": "yes", "notes": "Gonna try and resist eating any of my chocolate statsh today, see if I can get at least one full-vegan day in early-on before I've run down the chocolate.\nBreakfast was another salad, got a little bit scared when I couldn't see the \"suitable for vegans\" on the french dressing, but it is there, I did find it, phew.\nHousemate still does not suspect. Or at least they haven't let me know that they suspect. They've certainly seen me with some very vegan foods.\nI wonder how long it will be before they say notice or say something.\nNormally I have up to 12 pints of milk in the fridge at once. (Yes, I drank quite a lot of milk) But with Alpro in its place, surely they're gonna start to wonder soon.\n\nUpdate from 8pm: housemate now knows, we got deliveroo from a half-vegan place. I had vegan, they had pork, boooo!\nYes I decided not to cook, shame on me. Was nice food though, some kind of greek street food thing.\n\nUpdate from 23:30: Just tried Soya milk for the first time. It's soooo much better than almond milk.\nI don't know if I want to sample all the various nut milks, but I think soya would be a suitable alternative for me.\nSo far I have tried almond milk, both sugary and sugarless, and also sugary soya milk. No question the soya is the best, no bitter aftertaste for me.\n\nAlso I bought some vegan cheeses and vegan \"milk\" chocolate. Will try some of those at some point soon and report my thougts.", "images": ["greek_wrap_thing.jpg", "plant_milks_leftbad_rightgood.jpg"], "image_alts": ["Foreground: A greek sreet-food style wrap containing spicy chips, athenian sauce, and a tomato based filling with various spices. Background: A portion of oregano fries.", "Two plant based drinks in cartons on a fridge door shelf. The left carton is Alpro Almond no-sugars drink, the right carton is Alpro Soya drink."]}, "6": {"answer": "probably", "notes": "Lunch time gone, done fine so far.\nTried Montezuma's \"Like no udder\" milk chocolate alternative. Looks like dark chocolate, smells like dark chocolate, quacks like dark chocolate, but it tastes like ... diluted dark chocolate?\nFor the record, I don't like dark chocolate. Ewwww it's horrible, I don't know how people can like dark chocolate. This Like no Udder is okay, but I probably won't seek it out.\nMilk chocolate is sooooo good. Would like to find an acceptable substitute.\n\nDinner time update: Had some fake mince. It was the Vegetarian Butcher's Magic Mince. Praise the gods of veganism for we have been blessed with the holy grail of fake meats.\nDidn't get my hopes up for it really, after the experience I had with \"This is Not Chicken\" I wasn't expecting the strongest of comebacks from the world of fake meats so suddenly.\nTruly magic mince must actually be magic. It cooks quicker. It cooks easier. It tastes better. Just that simple.\n\nAlso, the reason today is a \"probably\" is because I can't find a primary source of information to answer the question \"Is Dolmio Original bolognese sause vegan?\".\nTheir official website doesn't say it is vegan, only that it is vegetarian, which makes me suspect that it is not vegan.\nWas my evening's Pasta Bolognese vegan? Who knows?", "images": ["bolognese.jpg", "magic.jpg", "basically_dark_chocolate.jpg"], "image_alts": ["A plate with fusili pasta and a bolognese sauce with various vegetables and a mince-like vegan meat substitute. The plate has a spoon and a knife resting on it.", "The outer packaging from a packet of \"Magic Mince\" from The Vegetarian Butcher.", "Montezuma's \"Like no Udder\" vegan milk chocolate substitute, opened with a segment of the chocolate bar substitute broken off and resting on top of the packaging."]}, "7": {"answer": "probably", "notes": "Another \"probably\" day, because I had the leftovers from yesterday and I'm still not sure if that pasta sauce is vegan.\nAnother new experience today: \"Creamy Original Flavour Violife\". It is AMAZING! If this was the same price as dairy soft cheeses then I would be recommending this to all my non-vegan soft-cheese-eating friends, and not even as a joke. This is actually good stuff!\nI have had some on my cream crackers, which are also vegan (of course, I'm doing veganuary, that's the whole point of this thing. Also I'm not sure how you would make crackers not-vegan, but I'm sure there's a way.)\n\nNothing else new today though. I do have another vegan cheese to try, but I stuffed myself with creamy-violife-covered crackers and so I'm not really in the mood for more cheese today.", "images": ["creamy_violife_crackers.jpg"], "image_alts": ["A plate with a partially-opened tub of Violife Creamy vegan soft-cheese substitute and two cream crackers that have had some of the Violife from the tub applied to them. There is also a knife on the plate, which has some of the violife spread on it."]}, "8": {"answer": "no", "notes": "I ate lindor.\n\nHey! Don't be like that, I already had it in the house and I need to get through it all. I didn't buy any of it recently. I got it all for Christmas as gifts.\n\nOther than that I've been a good person though. :)\nUpdate: Tried another wrap from the place I got food from on Tuesday 5th. (I know, getting takeaway food from the same place twice in one week, oh my!)\nThis one had a fake frankfurter in it, it was good. I enjoyed it so much I had eaten it before remembering to take a photo for this log.", "images": [], "image_alts": []}, "9": {"answer": "yes", "notes": "Tried \"Applewood Vegan\" today (it's a cheese substitute).\nIt's not bad, tastes quite smokey. I've never had a smokey cheese before so I don't know if this is exactly how all the others taste, but it was very smokey and very cheesy.", "images": ["applewood.jpg"], "image_alts": ["A packet of \"Applewood Vegan\", a vegan cheese-substitute. The packet has been opened and part of the block inside has been cut away from the rest."]}, "10": {"answer": "yes", "notes": "Nothing much to report, really.\n\nCoconut milk is quite good. That's new :)", "images": [], "image_alts": []}, "11": {"answer": "yes", "notes": "Decided to try frying some vegan sausages for dinner today. I had some richmond fake sausages in a caserole earlier in january, but this time I'm just gonna fry them and have them with some vegetables.\nA fairly simple meal.\nOtherwise nothing too special today. Bought a couple of other vegan cheeses to try, we'll see how those go tomorrow I think.\n\nWill report back on the vegan sausages later...\n\nUpdate: it is now later :)\nThe vegan chipolatas tasted not like real chipolatas. This was entirely anticipated.\nThe taste is okay, but it's not something I think I really want to eat again. Compared to the taste of something like the vegetarian butcher magic mince that I had recently, it's not really on the same level at all. :'(", "images": ["sausages_in_pan.jpg", "heck_packet.jpg", "meal.jpg"], "image_alts": ["Heck vegan chipolatas being fried in a pan.", "The packaging for Heck vegan Chipolatas.", "Cooked potates, brocoli, and Heck vegan Chipolatas on a plate."]}, "12": {"answer": "probably", "notes": "* sigh * another \"probably\" today because of the pasta sauce. I had some more of it. :'(\n\nTried a spicy vegan cheese today, it was spicy. :)\nI'm not sure I'm really a fan of spicy cheese. I probably won't buy it again. Tasted fine, but the things that I want cheese on are not generally the things I want to be spicy.", "images": ["spicy_cheese.jpg"], "image_alts": ["Packet of Tesco Free-from Coconut oil alternative to Jalapeño and chilli cheese."]}, "13": {"answer": "yes", "notes": "Fiarly boring day today, no new vegan experiences to report.", "images": [], "image_alts": []}, "14": {"answer": "probably", "notes": "That pasta sauce struck again, leftovers from the last batch I made, that makes today another probably. I'm gonna eat the last bit tomorrow, then I will have no more of it until the end of Jan.\n\nIt's half way through now and I've not really done that well. If we count the \"probably\" days then I have achieved a streak of 6 including today.\nThe counter at the top of this page does not count those days though, sadly. (I could change that but it would feel wrong.) So actually I've only done 3 days.\nSo that's not a particularly good record, and I think that's because I decided late to do this, I didn't prepare for it, I had so much leftover non-vegan stuff, and I was careless when buying pasta sauce.\n\nOkay, so here's the plan...\nI'm gonna get to the end of January eating as vegan as possible, then I'm gonna eat all of the non-vegan stuff that I have in one day (I _think_ that's possible, I don't have much left).\nThat day will be the 31st of January. By that point I will have been through most of January and will have a baseline to compare February against.\nAnd so, clearly if I want to do things properly, I need to do a fully vegan month in February. What shall I call it? ... hmmm ... Vegebruary I suppose.", "images": [], "image_alts": []}, "15": {"answer": "probably", "notes": "Okay, so I ate the rest of pasta sauce that I had cooked, another probably today. Won't cook any more of that for a while\nAnyway...\nFriday night, feels like a good excuse for a takeaway, so I got a vegan vindaloo on Deliveroo from a local indian restaurant.\nIt was spicy, good. Contained cauliflower though, ew, hate that stuff. Broccoli ghost bad :( broccoli living good :)", "images": ["vindaloo.jpg"], "image_alts": ["A vegan vindaloo curry with rice, on a plate, with cutlery."]}, "16": {"answer": "yes", "notes": "Violife cheese blocks: difficult to get out the packet, but taste basically exacrly like mild chedar.\nExcellent.\nI forgot to take a photo though. Shame on me.", "images": [], "image_alts": []}, "17": {"answer": "yes", "notes": "I bought two vegan gravys yesterday from tesco. Decided I would try one today. I started with the \"Gravy granules for beef\".\nI had to fulfill the vegan obligation to laugh at the fact that they suggest you put this stuff on beef sausages.\n(I know, I know, but I wanna have some fun here :D ...)\nFor one: I'm vegan b*thces! XD\nFor two: Hmmmm, beef sausages. If you're gonna eat beef you want a steak. Well done, of course. Pork sausages are the best sausages.\n ... oh no, now the vegans are angry at me for liking beef steak and pork, and all the people that think \"well done\" steak is pure evil are also angry at me.\nAnyway, I made bangers and mash. I had the gravy. The gravy was not particularly noticable. Which is either: good because I can't tell it apart from normal gravy, or bad because actually it's tasteless and I'm missing something by using this gravy.\nThe mash was good, the veg was veg (you can't really get veg wrong, it was good), but I really don't like these Heck sausages. I'm not gonna buy them again.\nThe richmond ones I had before were okay, but I slow cooked those in a really good sauce. Maybe I'll try having them \"neat\" and see if they're better than Heck's.", "images": ["gravys.jpg", "bangers_mash.jpg"], "image_alts": ["Two pots of gravy granules standin on a counter. Left: Gravy granules for beef, Right: Vegetable gravy granules.", "Vegan bangers and mash with peas, carrots, sweetcorn. On a plate with a jug of gravy nearby, a can of Coke, and a jar of mint sauce."]}, "18": {"answer": "yes", "notes": "Nothing noteworthy today, but it was a vegan day.", "images": [], "image_alts": []}, "19": {"answer": "yes", "notes": "Am I getting deliveroo too frequently these days?\nWell never mind, there's [conveniently] no time to answer that question becuase I need to tell you about \"Vegan Vice\".\nThey're in cambridge on deliveroo and they do these things called \"Hot Chilli Strips\" and they're like chicken strips but they're not chicken.\nThey're vegan, they're tasty, they're pleasingly spicy, they're crispy but not too crispy, they're \"OH MY GOODNESS I WANT MORE OF THIS IN MY MOUTH\" kind of good.\nNever expected to be throwing such compliments around for vegan food.\n\nIf I was to revert to being a carnivore, I would no doubt still be eating some of the vegan things that I've tried this month. Various vegan cheeses for sure, these magical things from Vegan Vice also, and that magic mince stuff too.\nMmmmmmm, this evening's food was gooooood. :D", "images": [], "image_alts": []}, "20": {"answer": "yes", "notes": "fairly boring day today", "images": [], "image_alts": []}, "21": {"answer": "probably", "notes": "cooked with last of the pasta sauce, will soon be gone", "images": [], "image_alts": []}, "22": {"answer": "yes", "notes": "nothing special today", "images": [], "image_alts": []}, "23": {"answer": "yes", "notes": "I was in a hurry this evening, didn't want to prepare food for myself so I got takeaway again.\nI got the same chicken style thing that I was really impressed with recently. Got a photo of it this time.", "images": ["not_chicken.jpg"], "image_alts": ["A takeaway food container containing strips of a deep fried chicken substitute. Also a paper packet of chips and a can of coca cola."]}, "25": {"answer": "yes", "notes": "Beef madras but with not beef.\nNot bad. Doesn't taste like beef, but it's not bad.", "images": ["vegan_madras.jpg", "plant_beef.jpg"], "image_alts": ["", ""]}}}}